src/BusinessProcesses/бпсСогласование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<BusinessProcess>
		<Properties>
			<Name>бпсСогласование</Name>
			<Task>Task.бпсЗадача</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредметСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПредметыСогласований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектБД</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийНомерОчереди</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколФормированияЛистаСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпрощеннаяСистемаУведомлений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьИнициатораОЗавершении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноПовторноеСогласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьНаПовторноеСогласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛистСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольАдресации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бпсРолиАдресации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеАдресации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бпсПодразделенияАдресации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рецензия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючЗадачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПользователиДляУведомления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бпсСобытия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УведомлятьПочтой</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УведомлятьЗадачей</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бпсСобытия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бпсДействия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

src/Enums/бпсКомандыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>бпсКомандыСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВернутьНаДоработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьНаПовторноеСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрекратитьСогласование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/BusinessProcesses/бпсСогласование/Forms/ФормаРецензента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаСогласовано(Команда)
	КомандаСогласования = ПредопределенноеЗначение("Перечисление.бпсКомандыСогласования.Согласовано");
	ВыполнитьКомандуНаКлиенте(КомандаСогласования);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуНаКлиенте(КомандаСогласования)
	ВыполнитьЗадачуНаСервере(КомандаСогласования);
	Модифицированность = Ложь;
	Оповестить("ЗадачаФормаСписка_Обновить");	
	Оповестить("бпсСтатусыСогласований_Обновить");
	Закрыть();	
КонецПроцедуры //ВыполнитьКомандуНаКлиенте("Согласовано")

&НаСервере
Процедура КомандаСогласованоНаСервере(КомандаСогласования) Экспорт
	ВыполнитьЗадачуНаСервере(КомандаСогласования);	
КонецПроцедуры //КомандаСогласованоНаСервере()

&НаСервере
Процедура ВыполнитьЗадачуНаСервере(КомандаСогласования) Экспорт
	БизнесПроцессОбъект = РеквизитФормыВЗначение("Объект"); 
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("ЗадачаСсылка",ЗадачаСсылка);
	ДопПараметры.Вставить("Рецензия",Рецензия);
	ДопПараметры.Вставить("КомандаСогласования",КомандаСогласования);
	БизнесПроцессОбъект.ВыполнитьЗадачу(ДопПараметры);
КонецПроцедуры //ВыполнитьЗадачуНаСервере(Истина)

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗадачаСсылка = Параметры.ЗадачаСсылка;
	
	КлючЗадачи = ЗадачаСсылка.КлючЗадачи;
	ПараметрыОтбора=Новый Структура();
	ПараметрыОтбора.Вставить("КлючЗадачи",КлючЗадачи);
	НайденныеСтроки = Объект.ЛистСогласования.НайтиСтроки(ПараметрыОтбора);
	Для каждого СтрокаЛистСогласования из НайденныеСтроки цикл
		Пояснение = СтрокаЛистСогласования.Пояснение;
		Рецензия = СтрокаЛистСогласования.Рецензия;
	Конеццикла;
	Заголовок = ЗадачаСсылка.Наименование;
	
	УстановитьОтборДляИсторииРецензий();
	
	Элементы.ФормаКомандаВозвращеноНаДоработку.Видимость = Ложь;
	Если Объект.РазрешеноПовторноеСогласование Тогда
		Элементы.ФормаКомандаВозвращеноНаДоработку.Видимость = Истина;
	Конецесли;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДляИсторииРецензий() Экспорт
	ИсторияРецензий.Параметры.УстановитьЗначениеПараметра("ИсходныйБизнесПроцесс",Объект.Ссылка);
КонецПроцедуры //ИзменитьЭлементОтбораСписка()

&НаКлиенте
Процедура КомандаНеСогласовано(Команда)
	КомандаСогласования = ПредопределенноеЗначение("Перечисление.бпсКомандыСогласования.НеСогласовано");
	ВыполнитьКомандуНаКлиенте(КомандаСогласования);
КонецПроцедуры

&НаКлиенте
Процедура КомандаВозвращеноНаДоработку(Команда)
	КомандаСогласования = ПредопределенноеЗначение("Перечисление.бпсКомандыСогласования.ВернутьНаДоработку");
	ВыполнитьКомандуНаКлиенте(КомандаСогласования);
КонецПроцедуры
